package ziwei

import (
	"fmt"
	"reflect"
	"strings"
	"testing"
)

//十四星
func TestGetStar(t *testing.T) {
	zwzhi := "子"
	GetStar14Map(zwzhi)
}

//13星
func TestGetStar13Arr(t *testing.T) {
	zwzhi := "子"
	zwzhi = "丑"

	GetStar13Arr(zwzhi)
	wantArr := map[string][]string{
		"子": {"亥", "酉", "申", "未", "辰", "辰", "巳", "午", "未", "申", "酉", "戌", "寅"},
		"丑": {"子", "戌", "酉", "申", "巳", "卯", "辰", "巳", "午", "未", "申", "酉", "丑"},
		"寅": {"丑", "亥", "戌", "酉", "午", "寅", "卯", "辰", "巳", "午", "未", "申", "子"},
		"卯": {"寅", "子", "亥", "戌", "未", "丑", "寅", "卯", "辰", "巳", "午", "未", "亥"},
		"辰": {"卯", "丑", "子", "亥", "申", "子", "丑", "寅", "卯", "辰", "巳", "午", "戌"},
		"巳": {"辰", "寅", "丑", "子", "酉", "亥", "子", "丑", "寅", "卯", "辰", "巳", "酉"},
		"午": {"巳", "卯", "寅", "丑", "戌", "戌", "亥", "子", "丑", "寅", "卯", "辰", "申"},
		"未": {"午", "辰", "卯", "寅", "亥", "酉", "戌", "亥", "子", "丑", "寅", "卯", "未"},
		"申": {"未", "巳", "辰", "卯", "子", "申", "酉", "戌", "亥", "子", "丑", "寅", "午"},
		"酉": {"申", "午", "巳", "辰", "丑", "未", "申", "酉", "戌", "亥", "子", "丑", "巳"},
		"戌": {"酉", "未", "午", "巳", "寅", "午", "未", "申", "酉", "戌", "亥", "子", "辰"},
		"亥": {"戌", "申", "未", "午", "卯", "巳", "午", "未", "申", "酉", "戌", "亥", "卯"},
	}
	zhiArr := []string{"子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"}

	for i := 0; i < len(zhiArr); i++ {
		arr := GetStar13Arr(zhiArr[i])
		for k, v := range wantArr {
			if strings.EqualFold(zhiArr[i], k) {
				fmt.Println(k, zhiArr[i], v, arr)
				if !reflect.DeepEqual(v, arr) {
					t.Errorf("func (%s)=%s want:%s\n", zhiArr[i], arr, v)
				}
			}
		}
	}
}
