package ziwei

//紫微星地支宫位
func GetZiWei(wxn, lday int) string {
	return fingZiWeiZhi(wxn, lday)
}

//传入五行数字 阴历日数字(初一到三十) 返回紫微星对应的地支(紫微星所在宫位)
func fingZiWeiZhi(wxn, lday int) string {
	//k五行局(水 木 金 土 火)  v阴历月对应的地支(0:初一)
	wxmap := map[int][]string{
		2: {"丑", "寅", "寅", "卯", "卯", "辰", "辰", "巳", "巳", "午", "午", "未", "未", "申", "申", "酉", "酉", "戌", "戌", "亥", "亥", "子", "子", "丑", "丑", "寅", "寅", "卯", "卯", "辰"},
		3: {"辰", "丑", "寅", "巳", "寅", "卯", "午", "卯", "辰", "未", "辰", "巳", "申", "巳", "午", "酉", "午", "未", "戌", "未", "申", "亥", "申", "酉", "子", "酉", "戌", "丑", "戌", "亥"},
		4: {"亥", "辰", "丑", "寅", "子", "巳", "寅", "卯", "丑", "午", "卯", "辰", "寅", "未", "辰", "巳", "卯", "申", "巳", "午", "辰", "酉", "午", "未", "巳", "戌", "未", "申", "午", "亥"},
		5: {"午", "亥", "辰", "丑", "寅", "未", "子", "巳", "寅", "卯", "申", "丑", "午", "卯", "辰", "酉", "寅", "未", "辰", "巳", "戌", "卯", "申", "巳", "午", "亥", "辰", "酉", "午", "未"},
		6: {"酉", "午", "亥", "辰", "丑", "寅", "戌", "未", "子", "巳", "寅", "卯", "亥", "申", "丑", "午", "卯", "辰", "子", "酉", "寅", "未", "辰", "巳", "丑", "戌", "卯", "申", "巳", "午"},
	}
	var zwZhi string //紫微宫地支
	for k, ldayArr := range wxmap {
		if wxn == k {
			for i := 0; i < len(ldayArr); i++ {
				if ld := lday - 1; ld == i {
					zwZhi = ldayArr[i]
					break
				}
			}
			break
		}
	}
	return zwZhi
}
